app/controllers/pages_controller.rb

SELECT  "pages".* FROM "pages" ORDER BY "pages"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @pages = Page.all

INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My name"], ["body", "My name is Ronnie John Michael Dineen"], ["slug", "My Name"], ["created_at", "2017-05-22 23:06:11.856650"], ["updated_at", "2017-05-22 23:06:11.856650"]]
---
  def create
    @page = Page.new(page_params)
    @page.save

UPDATE "pages" SET "title" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["title", "About this blog!"], ["updated_at", "2017-05-22 23:31:08.178348"], ["id", 1]]
---
  def update
    @page.update(page_params)

DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]
---
  def destroy
    @page.destroy

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_page
      @page = Page.find(params[:id])