app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at", "body") VALUES (?, ?, ?, ?)  [["title", "Post to permit body"], ["created_at", "2017-05-21 20:39:19.149426"], ["updated_at", "2017-05-21 20:39:19.149426"], ["body", "Permitted is true"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Second post!"], ["updated_at", "2017-05-20 23:42:59.920354"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)