app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "iRonnie16"], ["email", "rondin.rd@gmail.com"], ["created_at", "2017-05-28 23:16:34.494471"], ["updated_at", "2017-05-28 23:16:34.494471"]]
---
  def create
    if params[:user].present?
      @user = User.new(user_params)
      puts @user.errors.full_messages
      if @user.save